---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.BendFailures.NotBentFilledRegion
source: html/d46c23db-ab6c-1b6d-a31f-a44e1069228a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.BendFailures.NotBentFilledRegion Property

While making curved beam type "[Type Name]" Filled Region elements were not created

## Syntax (C#)
```csharp
public static FailureDefinitionId NotBentFilledRegion { get; }
```